Hi @ilfox, Thanks for raising this issue. If I understand correctly, it seems you don't need to configure wildward. When type is set to ipmask, wildward does not need to be set. 

**Validation:**

_**1 Create address object with subnet  = "10.145.224.128/25"**_

```
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

variable subnet {
  default = "10.145.224.128/25"
}

resource "fortios_firewall_address" "infra_address" {
  allow_routing         = "disable"
  cache_ttl             = 0
  color                 = 0
  dynamic_sort_subtable = "false"
  name                  = "infra_fw_object"
  subnet                = var.subnet
  type                  = "ipmask"
}
```
```
# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_address.infra_address will be created
  + resource "fortios_firewall_address" "infra_address" {
      + allow_routing         = "disable"
      + associated_interface  = (known after apply)
      + cache_ttl             = 0
      + clearpass_spt         = (known after apply)
      + color                 = 0
      + country               = (known after apply)
      + dynamic_sort_subtable = "false"
      + end_ip                = (known after apply)
      + end_mac               = (known after apply)
      + epg_name              = (known after apply)
      + fqdn                  = (known after apply)
      + id                    = (known after apply)
      + interface             = (known after apply)
      + name                  = "infra_fw_object"
      + node_ip_only          = (known after apply)
      + obj_tag               = (known after apply)
      + obj_type              = (known after apply)
      + organization          = (known after apply)
      + policy_group          = (known after apply)
      + sdn                   = (known after apply)
      + sdn_addr_type         = (known after apply)
      + sdn_tag               = (known after apply)
      + start_ip              = (known after apply)
      + start_mac             = (known after apply)
      + sub_type              = (known after apply)
      + subnet                = "10.145.224.128/25"
      + subnet_name           = (known after apply)
      + tenant                = (known after apply)
      + type                  = "ipmask"
      + uuid                  = (known after apply)
      + visibility            = (known after apply)
      + wildcard              = (known after apply)
      + wildcard_fqdn         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_address.infra_address: Creating...
fortios_firewall_address.infra_address: Creation complete after 0s [id=infra_fw_object]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
root@sv:/work/zamba/03b-fos-gen-coverall/03Terraform/bin#

```
```
Labfirewall # config firewall address

Labfirewall (address) # show
config firewall address
    edit "infra_fw_object"
        set uuid e681211a-ae11-51eb-a31b-4a700b14d46d
        set subnet 10.145.224.128 255.255.255.128
    next
end
```

_**2 Modifty subnet  = "10.145.228.128/25"**_
```
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

variable subnet {
  default = "10.145.228.128/25"
}

resource "fortios_firewall_address" "infra_address" {
  allow_routing         = "disable"
  cache_ttl             = 0
  color                 = 0
  dynamic_sort_subtable = "false"
  name                  = "infra_fw_object"
  subnet                = var.subnet
  type                  = "ipmask"
}
```
```
# terraform apply
fortios_firewall_address.infra_address: Refreshing state... [id=infra_fw_object]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # fortios_firewall_address.infra_address will be updated in-place
  ~ resource "fortios_firewall_address" "infra_address" {
        allow_routing         = "disable"
        cache_ttl             = 0
        clearpass_spt         = "unknown"
        color                 = 0
        dynamic_sort_subtable = "false"
        end_mac               = "00:00:00:00:00:00"
        id                    = "infra_fw_object"
        name                  = "infra_fw_object"
        obj_type              = "ip"
        sdn_addr_type         = "private"
        start_mac             = "00:00:00:00:00:00"
        sub_type              = "sdn"
      ~ subnet                = "10.145.224.128/25" -> "10.145.228.128/25"
        type                  = "ipmask"
        uuid                  = "e681211a-ae11-51eb-a31b-4a700b14d46d"
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_address.infra_address: Modifying... [id=infra_fw_object]
fortios_firewall_address.infra_address: Modifications complete after 0s [id=infra_fw_object]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```
```
Labfirewall # config firewall address

Labfirewall (address) # show
config firewall address
    edit "infra_fw_object"
        set uuid e681211a-ae11-51eb-a31b-4a700b14d46d
        set subnet 10.145.228.128 255.255.255.128
    next
end
```
```
# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_firewall_address.infra_address: Refreshing state... [id=infra_fw_object]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
```
Thank you!

